<?php


return [
    'app-name'          =>  "بیمارستان میلاد لاهیجان",
    'reply-to'          =>  "پاسخ به :username",
    'search.results'    =>  "نتایج جستجوی :search",
    '404.title'         =>  "404 صفحه یافت نشد",
    '400.title'         =>  " درخواست اشتباه ",
    '403.title'         =>  "403 ممنوع",
    '429.title'         =>  "429  درخواست بیش از حد",
    '500.title'         =>  "500 خطای سرور داخلی",
    '503.title'         =>  "503 سرویس در دسترس نیست",
    '504.title'         =>  "504 مهلت زمانی دروازه",

];
