<?php

return [
    'group_created' => 'گروه جدید ایجاد شد.',
    'group_updated' => 'اطلاعات گروه با موفقیت بروز رسانی شد.',
    'profile_updated' => 'پروفایل کاربری با موفقیت بروز رسانی شد.',
    'current_password_invalid' => 'کلمه عبور فعلی اشتباه است.',
    'password_changed' => 'کلمه عبور با موفقیت تغییر کرد.',
    'invalid_otp' => "کد اعتبارسنجی نا معتبر است.",
    'google2fa_verified' => 'احراز هویت دومرحله ای google authenticator با موفقیت فعال شد.',

    'election' => [
        'created' => 'همه پرسی جدید اضافه شد',
        'edited' => 'همه پرسی با موفقیت ویرایش شد.',
        'deleted' => 'همه پرسی مورد نظر با موفقیت حذف شد',
    ],

    'role' => [
        'created' => 'نقش جدید با موفقیت ایجاد شد.',
        'updated' => 'نقش با موفقیت بروزرسانی شد.',
        'deleted' => 'نقش با موفقیت حذف شد.',
        'cannot_delete_system' => 'نمی‌توانید نقش‌های پیش‌فرض را حذف کنید.',
        'create_error' => 'خطایی هنگام ایجاد نقش رخ داد.',
        'update_error' => 'خطایی هنگام بروزرسانی نقش رخ داد.',
        'delete_error' => 'خطایی هنگام حذف نقش رخ داد.',
    ],

    'validation' => [
        'role' => [
            'name_required' => 'نام نقش الزامی است.',
            'name_unique' => 'این نام نقش قبلاً استفاده شده است.',
            'permissions_array' => 'دسترسی‌ها باید به صورت آرایه باشند.',
            'permissions_exists' => 'دسترسی انتخاب شده معتبر نیست.',
        ]
    ],

    'permission' => [
        'index_error' => 'خطایی هنگام دریافت دسترسی‌ها رخ داد.',
    ],

    'user' => [
        'user_access_error' => 'اعطای دسترسی به کاربر مورد نظر با خطا مواجه شد.',
        'access_changed' => 'دسترسی ها با موفقیت به کاربر اعطا شد.',
    ]
];
